app/Models/ActionInDB.php

INSERT INTO `performances` (`idExercice`, `idSeance`, `numero_serie`, `poids_effectif`, `reps`)
VALUES (1,'3',1,'65','10'), (1,'3',3,'65','4')
---
	public function ajouterPerformances($data)
	{
		// insertBatch permet d'insérer un tableau de tableaux en une seule requête SQL
		return $this->db->table('performances')->insertBatch($data);

UPDATE `seances` SET `status` = 'en_cours'
WHERE `id` = '3'
---
	public function updateStatusSeance($idSeance, $status)
	{
		return $this
			->db
			->table('seances')
			->where('id', $idSeance)
			->update(['status' => $status]);

DELETE FROM `performances`
WHERE `idSeance` = '3'
---
	public function nettoyerPerformances($idSeance)
	{
		return $this->db->table('performances')->where('idSeance', $idSeance)->delete();

UPDATE `exercice` SET `estActif` = 0
WHERE `id` = '1'
---
	public function deleteExercice($id)
	{
		// SUPPRESSION LOGIQUE : On archive l'exercice au lieu de le supprimer
		return $this
			->db
			->table('exercice')
			->where('id', $id)
			->update(['estActif' => 0]);