app/Models/Donnees.php

	public function getSimpleSeance($idSeance)
	{
		return $this
			->db
			->table('seances')
			->where('id', $idSeance)
			->get()
			->getRowArray();
---
SELECT *
FROM `seances`
WHERE `id` = '3'

	public function getPerformancesRealisees($idSeance)
	{
		$query = $this
			->db
			->table('performances')
			->where('idSeance', $idSeance)
			->get()
			->getResultArray();
---
SELECT *
FROM `performances`
WHERE `idSeance` = '3'