app/Models/Donnees.php

	public function getLesProgrammes()
	{
		return $this
			->db
			->table('programme')
			->select('id, libelle')
			->get()
			->getResultArray();
---
SELECT `id`, `libelle`
FROM `programme`

	public function getUneProgramme($idProgramme)
	{
		return $this
			->db
			->table('programme')
			->select('id, libelle')
			->where('id', $idProgramme)
			->get()
			->getRowArray();
---
SELECT `id`, `libelle`
FROM `programme`
WHERE `id` = '1'

	public function getLesExercices()
	{
		return $this
			->db
			->table('exercice')
			->select('id, idProgramme, libelle, charge, nbSeries')
			->orderBy('ordre', 'ASC')
			->get()
			->getResultArray();
---
SELECT `id`, `idProgramme`, `libelle`, `charge`, `nbSeries`
FROM `exercice`
ORDER BY `ordre` ASC

	public function getExercicesParProgramme($idProgramme)
	{
		return $this
			->db
			->table('exercice')
			->where('idProgramme', $idProgramme)
			->where('estActif', 1)
			->orderBy('ordre', 'ASC')
			->get()
			->getResultArray();
---
SELECT *
FROM `exercice`
WHERE `idProgramme` = '1'
AND `estActif` = 1
ORDER BY `ordre` ASC

	public function getUnExercice($id)
	{
		return $this
			->db
			->table('exercice')
			->where('id', $id)
			->get()
			->getRowArray();
---
SELECT *
FROM `exercice`
WHERE `id` = '1'

	public function getLesSeances()
	{
		return $this
			->db
			->table('seances s')
			->select('s.id, c.libelle, s.date_seance, s.status')
			->join('programme c', 's.idProgramme = c.id')
			->orderBy('s.date_seance', 'DESC')
			->orderBy('s.id', 'DESC')
			->get()
			->getResultArray();
---
SELECT `s`.`id`, `c`.`libelle`, `s`.`date_seance`, `s`.`status`
FROM `seances` `s`
JOIN `programme` `c` ON `s`.`idProgramme` = `c`.`id`
ORDER BY `s`.`date_seance` DESC, `s`.`id` DESC

	public function getUneSeances($id)
	{
		// Pour des requêtes complexes avec GROUP_CONCAT, le Query Builder est aussi possible
		// et rend la lecture des JOIN plus claire.
		return $this
			->db
			->table('performances p')
			->select('c.libelle AS titre, s.date_seance AS date, e.libelle')
			->select("GROUP_CONCAT(p.reps ORDER BY p.numero_serie ASC SEPARATOR ', ') as liste_reps")
			->select("GROUP_CONCAT(p.poids_effectif ORDER BY p.numero_serie ASC SEPARATOR ', ') as liste_poids")
			->join('exercice e', 'p.idExercice = e.id')
			->join('seances s', 's.id = p.idSeance')
			->join('programme c', 'c.id = s.idProgramme')
			->where('p.idSeance', $id)
			->groupBy('e.id, e.libelle')
			->orderBy('e.id', 'ASC')
			->get()
			->getResultArray();
---
SELECT `c`.`libelle` AS `titre`, `s`.`date_seance` AS `date`, `e`.`libelle`, GROUP_CONCAT(p.reps ORDER BY p.numero_serie ASC SEPARATOR ', ') as liste_reps, GROUP_CONCAT(p.poids_effectif ORDER BY p.numero_serie ASC SEPARATOR ', ') as liste_poids
FROM `performances` `p`
JOIN `exercice` `e` ON `p`.`idExercice` = `e`.`id`
JOIN `seances` `s` ON `s`.`id` = `p`.`idSeance`
JOIN `programme` `c` ON `c`.`id` = `s`.`idProgramme`
WHERE `p`.`idSeance` = '3'
GROUP BY `e`.`id`, `e`.`libelle`
ORDER BY `e`.`id` ASC

	public function getSimpleSeance($idSeance)
	{
		return $this
			->db
			->table('seances')
			->where('id', $idSeance)
			->get()
			->getRowArray();
---
SELECT *
FROM `seances`
WHERE `id` = '3'

	public function getPerformancesRealisees($idSeance)
	{
		$query = $this
			->db
			->table('performances')
			->where('idSeance', $idSeance)
			->get()
			->getResultArray();
---
SELECT *
FROM `performances`
WHERE `idSeance` = '3'